src/config/Reports/ПланВыполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>ПланВыполненияЗадач</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКрупныйШрифт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЦветЗадач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВыходныеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьЗадачиОперативногоПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/InformationRegisters/ПланВыполненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПланВыполненияЗадач</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Reports/ПланВыполненияЗадач/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура кнВыбораПериода(Команда)
	
	Форма = ПолучитьФорму("ОбщаяФорма.БыстрыйВыборСтандартногоПериода");
	Форма.СтандартныйПериод.ДатаНачала = Отчет.ДатаНачала;
	Форма.СтандартныйПериод.ДатаОкончания = Отчет.ДатаОкончания;
	Форма.Дата = Отчет.ДатаНачала;
	
	РезультатВыбора = Форма.ОткрытьМодально();
	
	Если РезультатВыбора <> Неопределено Тогда
		
		Отчет.ДатаНачала = РезультатВыбора.ДатаНачала;
		Отчет.ДатаОкончания = РезультатВыбора.ДатаОкончания; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнМесяцРегулирование(Команда)
	
	ИмяКоманды = Команда.Имя;
	
	Если ИмяКоманды = "кнТекущийМесяц" Тогда
		
		//Отчет.ДатаНачала = НачалоМесяца(ТекущаяДата());
		//Отчет.ДатаОкончания = КонецМесяца(ТекущаяДата());
		СформироватьОтчетЗа6Недель();
		
	Иначе
		
		Если ИмяКоманды = "кнМесяцНазад" Тогда 
			
			ЧислоМесяцев = -1;
			
		ИначеЕсли ИмяКоманды = "кнМесяцВперед" Тогда
			
			ЧислоМесяцев = 1;
			
		КонецЕсли;
		
		Отчет.ДатаНачала = НачалоМесяца(ДобавитьМесяц(Отчет.ДатаНачала, ЧислоМесяцев));
		Отчет.ДатаОкончания = КонецМесяца(Отчет.ДатаНачала);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(Отчет, ТабДок);
	ТабДок.ТолькоПросмотр = Истина;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет()
	
	СформироватьОтчетНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияФормированияОтчета()
	
	//ОтключитьОбработчикОжидания("СформироватьОтчет");
	//ПодключитьОбработчикОжидания("СформироватьОтчет", 30);
	
КонецПроцедуры

                                             
&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	//ПодключитьОбработчикОжиданияФормированияОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетЗа6Недель()
	
	Если Отчет.ИспользоватьКрупныйШрифт Тогда
		Отчет.ДатаНачала = ТекущаяДата() - 4 * 86400;
		Отчет.ДатаОкончания = ТекущаяДата() + 4 * 86400;
	Иначе 
		Отчет.ДатаНачала = ТекущаяДата() - 3 * 7 * 86400;
		Отчет.ДатаОкончания = ТекущаяДата() + 3 * 7 * 86400;
	КонецЕсли;
	
	
	
	СформироватьОтчет();
	//ПодключитьОбработчикОжиданияФормированияОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьОтчетЗа6Недель();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредвПросмотр(Команда)
	
	ТекущийЭлемент = Элементы.ТабДок;
	// Произведем эмуляцию нажатия клавиш. По ходу дела это единственный способ открыть окно просмотра печати
	WHSShell = Новый COMОбъект("WScript.Shell");
	WHSShell.SendKeys("%");
	WHSShell.SendKeys("~");
	WHSShell.SendKeys("{DOWN 1}");
	WHSShell.SendKeys("~");
	WHSShell.SendKeys("{DOWN 8}");
	WHSShell.SendKeys("~");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	                      
	ПараметрыФормы = Новый Структура("Ключ", Отчет);
	
	Форма = ПолучитьФорму("Отчет.ПланВыполненияЗадач.Форма.ФормаНастроек", , ЭтаФорма);
	КопироватьДанныеФормы(ЭтаФорма.Отчет, Форма.Отчет);
	Форма.ОткрытьМодально();
	КопироватьДанныеФормы(Форма.Отчет, ЭтаФорма.Отчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачу(Расшифровка)
	
	Если Расшифровка <> Неопределено Тогда
		Если Расшифровка.ИмяСтруктуры = "ЗадачаПланаВыполнения" Тогда 
			ОбщийКлиент.ОткрытьЗадачуПоСсылке(Расшифровка.Задача);
		ИначеЕсли Расшифровка.ИмяСтруктуры = "ЗадачаОперативногоПлана" Тогда 
			ОбщийКлиент.ОткрытьЗадачуПоСсылке(Расшифровка.Задача);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗаписьПланаВыполнения()
	
	Расшифровка = Элементы.ТабДок.ТекущаяОбласть.Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		Если Расшифровка.ИмяСтруктуры = "ЗадачаПланаВыполнения" Тогда 
			МассивОтбораКлючаЗаписи = Новый Массив;

			ЗначениеКлюча = Новый Структура("Период, Задача, Исполнитель", Расшифровка.Период, Расшифровка.Задача, Расшифровка.Исполнитель);
			МассивОтбораКлючаЗаписи.Добавить(ЗначениеКлюча);

			КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ПланВыполненияЗадач", МассивОтбораКлючаЗаписи);
			
			ОткрытьФормуМодально("РегистрСведений.ПланВыполненияЗадач.ФормаЗаписи",	Новый Структура("Ключ", КлючЗаписи));
			Сформировать(Неопределено);
		ИначеЕсли Расшифровка.ИмяСтруктуры = "ЗадачаОперативногоПлана" Тогда 
			ЗначениеКлюча = Новый Структура("Период, Задача, Исполнитель", Расшифровка.Период, Расшифровка.Задача, Расшифровка.Исполнитель);
 			ОткрытьФормуМодально("РегистрСведений.ПланВыполненияЗадач.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", ЗначениеКлюча));
			//МассивОтбораКлючаЗаписи.Добавить(ЗначениеКлюча);

			//КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ПланВыполненияЗадач", МассивОтбораКлючаЗаписи);
			//
			//ОткрытьФормуМодально("РегистрСведений.ПланВыполненияЗадач.ФормаЗаписи",	Новый Структура("Ключ", КлючЗаписи));
			Сформировать(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьПланаВыполнения()
	
	Расшифровка = Элементы.ТабДок.ТекущаяОбласть.Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		Если Расшифровка.ИмяСтруктуры = "ЗадачаПланаВыполнения" Тогда 
			
			МенеджерЗаписи = РегистрыСведений.ПланВыполненияЗадач.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = Расшифровка.Период;
			МенеджерЗаписи.Задача = Расшифровка.Задача;
			МенеджерЗаписи.Исполнитель = Расшифровка.Исполнитель;
			
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда 
				МенеджерЗаписи.Удалить();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кмИзменитьЗаписьПланаВыполнения(Команда)
	
	ИзменитьЗаписьПланаВыполнения();

КонецПроцедуры

&НаКлиенте
Функция ПолучитьДатуВремяПравойГраницыВыделения(ТабДок)
	
	
		
КонецФункции

&НаКлиенте
Процедура РазместитьЗадачуНаКлиенте()
	                                             
	ТекущаяОбласть = Элементы.ТабДок.ТекущаяОбласть;
	Если ТекущаяОбласть.Верх <> ТекущаяОбласть.Низ Тогда 
		Сообщить("Некорректно выбрана область!");
		Возврат;
	КонецЕсли; 
	
	РасшифровкаНачало = ТабДок.Область("R"+ТекущаяОбласть.Верх + "C"+ТекущаяОбласть.Лево).Расшифровка;
	Если ТипЗнч(РасшифровкаНачало) <> Тип("Структура") Тогда
		
		Сообщить("Выбранная область некорректна! Тип расшифровки начала не структура.");
		
		Возврат;
	КонецЕсли;
	
	РасшифровкаКонец = ТабДок.Область("R"+ТекущаяОбласть.Верх + "C"+ТекущаяОбласть.Право).Расшифровка;
	Если ТипЗнч(РасшифровкаКонец) <> Тип("Структура") Тогда
		
		Сообщить("Выбранная область некорректна! Тип расшифровки конца не структура.");
		
		Возврат;
	КонецЕсли;
	
	// область выбрана правильно
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Задача", Неопределено);
	СтруктураПараметров.Вставить("Исполнитель", РасшифровкаНачало.Исполнитель);
	СтруктураПараметров.Вставить("Период", РасшифровкаНачало.Период);
	СтруктураПараметров.Вставить("ДатаНачалаПлан", РасшифровкаНачало.Период);
	СтруктураПараметров.Вставить("ДатаОкончанияПлан", РасшифровкаКонец.Период);
	
	ФормаЗаписи = ПолучитьФорму("РегистрСведений.ПланВыполненияЗадач.ФормаЗаписи");
	ЗаполнитьЗначенияСвойств(ФормаЗаписи.Запись, СтруктураПараметров);
	
	Результат = ФормаЗаписи.ОткрытьМодально();
		
КонецПроцедуры


&НаКлиенте
Процедура кмРазместитьЗадачу(Команда)
	
	РазместитьЗадачуНаКлиенте();
	Сформировать(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура кмУдалитьЗаписьПланаВыполнения(Команда)
	
	Ответ = Вопрос("Удалить запись?", РежимДиалогаВопрос.ДаНет, 10);
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		УдалитьЗаписьПланаВыполнения();
		Сформировать(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Расшифровка <> Неопределено Тогда
		
		Если ТипЗнч(Расшифровка.Задача) = Тип("ДокументСсылка.Задача") Тогда
			ОткрытьЗадачу(Расшифровка);
		Иначе 
			ИзменитьЗаписьПланаВыполнения();
		КонецЕсли;
		
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кмОткрытьЗадачу(Команда)
	
	Расшифровка = Элементы.ТабДок.ТекущаяОбласть.Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		ОткрытьЗадачу(Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередвинутьЗаписьНаДеньНаСервере(Расшифровка, НаправлениеВперед = Истина)
	
	МенеджерЗаписи = РегистрыСведений.ПланВыполненияЗадач.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период		= Расшифровка.Период;
	МенеджерЗаписи.Задача		= Расшифровка.Задача;
	МенеджерЗаписи.Исполнитель	= Расшифровка.Исполнитель;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда 
		
		МенеджерЗаписи.ДатаНачалаПлан 		= Общий.офИзменитьДатуНаДень(МенеджерЗаписи.ДатаНачалаПлан, НаправлениеВперед);
		МенеджерЗаписи.ДатаОкончанияПлан 	= Общий.офИзменитьДатуНаДень(МенеджерЗаписи.ДатаОкончанияПлан, НаправлениеВперед);
		
		МенеджерЗаписи.Записать();
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьДлительностьЗаписиНаДеньНаСервере(Расшифровка, НаправлениеВперед = Истина)
	
	МенеджерЗаписи = РегистрыСведений.ПланВыполненияЗадач.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период		= Расшифровка.Период;
	МенеджерЗаписи.Задача		= Расшифровка.Задача;
	МенеджерЗаписи.Исполнитель	= Расшифровка.Исполнитель;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда 
		
		//МенеджерЗаписи.ДатаНачалаПлан 		= ИзменитьДатуНаДень(МенеджерЗаписи.ДатаНачалаПлан, НаправлениеВперед);
		НоваяДатаОкончанияПлан = Общий.офИзменитьДатуНаДень(МенеджерЗаписи.ДатаОкончанияПлан, НаправлениеВперед);
		Если НоваяДатаОкончанияПлан < МенеджерЗаписи.ДатаНачалаПлан Тогда
			МенеджерЗаписи.ДатаОкончанияПлан = МенеджерЗаписи.ДатаНачалаПлан;
		Иначе 
			МенеджерЗаписи.ДатаОкончанияПлан = НоваяДатаОкончанияПлан;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Функция ПолучитьИмяОбластиПоРасшифровкеНаСервере(Расшифровка)
	
	ИмяОбласти = "R1C1:R1C1";
	
	НайденныеСтроки = Отчет.НаборРасшифровок.НайтиСтроки(Расшифровка);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			ИмяОбласти = "R"+ТекСтрока.RowT+"C"+ТекСтрока.ColL+":R"+ТекСтрока.RowB+"C"+ТекСтрока.ColR;
		КонецЦикла;
	КонецЕсли;

	Возврат ИмяОбласти;
	
КонецФункции


&НаКлиенте
Процедура кнПередвинутьНаДеньВперед(Команда)
	
	Расшифровка = Элементы.ТабДок.ТекущаяОбласть.Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		Если Расшифровка.ИмяСтруктуры = "ЗадачаПланаВыполнения" Тогда 
			ПередвинутьЗаписьНаДеньНаСервере(Расшифровка, Истина);
			Сформировать(Неопределено);
			Элементы.ТабДок.ТекущаяОбласть = ТабДок.Область(ПолучитьИмяОбластиПоРасшифровкеНаСервере(Расшифровка));
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура кнПередвинутьНаДеньНазад(Команда)
	
	Расшифровка = Элементы.ТабДок.ТекущаяОбласть.Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		Если Расшифровка.ИмяСтруктуры = "ЗадачаПланаВыполнения" Тогда 
			ПередвинутьЗаписьНаДеньНаСервере(Расшифровка, Ложь);
			Сформировать(Неопределено);
			Элементы.ТабДок.ТекущаяОбласть = ТабДок.Область(ПолучитьИмяОбластиПоРасшифровкеНаСервере(Расшифровка));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнУвеличитьВремяНаДень(Команда)
	
	Расшифровка = Элементы.ТабДок.ТекущаяОбласть.Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		Если Расшифровка.ИмяСтруктуры = "ЗадачаПланаВыполнения" Тогда 
			ИзменитьДлительностьЗаписиНаДеньНаСервере(Расшифровка, Истина);
			Сформировать(Неопределено);
			Элементы.ТабДок.ТекущаяОбласть = ТабДок.Область(ПолучитьИмяОбластиПоРасшифровкеНаСервере(Расшифровка));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнУменьшитьВремяНаДень(Команда)
	
	Расшифровка = Элементы.ТабДок.ТекущаяОбласть.Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		Если Расшифровка.ИмяСтруктуры = "ЗадачаПланаВыполнения" Тогда 
			ИзменитьДлительностьЗаписиНаДеньНаСервере(Расшифровка, Ложь);
			Сформировать(Неопределено);
			Элементы.ТабДок.ТекущаяОбласть = ТабДок.Область(ПолучитьИмяОбластиПоРасшифровкеНаСервере(Расшифровка));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
